#include <stdio.h>
#include <stdlib.h>
#include <math.h>
int main()
{
  /* Обчислення значення функції, заданої логічною залежністю. Використання вкладених умовних операторів. */
  float x,  // значення аргумента
      y,    // значення функції
      a, b; // параметри функції
  int nom;  // номер повідомлення (0 – обчислено значення)
  system("chcp 1251 & cls");
  /* Виведення вигляду функції на екран */
  printf("sin(3x)       при x [0,5)\n");
  printf("2e^(ax-1)+1    при x=5\n");
  printf("(bx-a)^-1    при x (5,12]\n");
  /* Введення вхідних даних */
  printf("\nВведіть значення a ");
  scanf("%f", &a);
  printf("Введіть значення b ");
  scanf("%f", &b);
  printf("Введіть значення x ");
  scanf("%f", &x);
  nom = 0;
  /* Обчислення значення функції */
  if ((x >= 0) && (x < 5)) // Перший проміжок
    if ((sin(3 * x) < -1) || (sin(3 * x) > 1))
      nom = 1; // ОДЗ порушено
    else
      y = sin(3 * x); // ОДЗ не порушено
  else if (x == 5)    // Другий проміжок - особливостей нема
    y = 2 * exp(a * x - 1) + 1;
  else if ((x > 5) && (x <= 12)) // Третій проміжок - особливостей нема
    y = pow((b * x - a), -1);
  else // Значення х задано поза проміжком
    nom = 2;
  /* Друк результату обчислення */
  switch (nom)
  {
  case 1:
    printf("ОДЗ сінуса порушено");
    break;
  case 2:
    printf("Функція не визначена");
    break;
  default:
    printf("f(%4.2f)=%6.3f", x, y);
  }
  /* Затримка вікна виведення */
  printf("\n\n");
  system("pause");
  return 0;
}