#include <stdio.h>
#include <stdlib.h>
#include <math.h>
int main()
{
  double x1, x2, h,   // границі проміжка і крок
      s,              // сума накопичення
      an,             // зміна для накопичування результату при знаходженні 2^n
      x, y;           // змінна х i обчислене значення функції
  double eps = 1e-14; // точність обчислень
  int ind,            // чи правильно задано вхідні дані
      i,              // номер обчисленого значення
      n,              // номер ітерації при знаходженні суми
      k = 3;          // кількість пар колонок

  printf("Табулювання функції:\n");
  printf("\tf(x)=sqrt((x+2)/(x+1)))*sum((2^n-x)/(n^2+1))+ln(x+5)\n");

  ind = 1;
  do
  { // доки не буде правильно введено дані

    /* Введення вхідних даних */
    printf("Вкажіть\n"); // Введення проміжку
    printf("\tпроміжок x1, x2: ");
    scanf("%lf %lf", &x1, &x2);

    if (x1 > x2)
      printf("***Помилка: x1>x2\n"); // Виведення помилки у проміжку

    else
    {
      printf("\tкрок h: "); // Введення кроку
      scanf("%lf", &h);

      if (h > x2 - x1 || h < 0)
        printf("***Помилка: h > x2 - x1 або h < 0\n"); // Виведення помилки у кроці
      else
        ind = 0; // закінчення циклу при правильному вводі всіх даних
    }
  } while (ind);

  /* Проведення обчислень і формування таблиці */
  x = x1;
  i = 0;

  // величина eps враховує похибку "плаваючої арифметики"
  while (x <= x2 + eps)
  {
    // інкрементація ітерації
    i += 1;

    // формування шапки таблиці
    if (i <= k)
    {
      printf("|   x   ");
      printf("|  f(x)  ");
    }
    else
    {
      printf("| %6.2f", x);
      if (x - 1 == 0 || ((x + 2) / (x - 1)) < 0 || x + 5 <= 0)
        printf("| не визн");
      else
      { // обчислення значення і вивід у таблицю
        s = 0;
        an = 1;
        for (n = 1; n <= 5; n++) // обчислення суми
        {
          an *= 2;
          s += ((pow(2, n) - x) / (pow(n, 2) + 1));
        }

        y = sqrt((x + 2) / (x - 1)) * s + log(x + 5); // обчислене значення функції

        // вивід значення функції або повідомлення "переповн"
        if (y <= pow(10, 6))
          printf("| %7.2f", y);

        else
          printf("|переповн");
      }
      x += h; // збільшення проміжку за кроком
    }

    if (i % k == 0)
      printf("|\n"); // перенесення рядків для формування таблиці
  }

  printf("\n\n");
  system("pause");
  return 0;
}