#include <stdio.h>

#include <stdlib.h>

#include <math.h>

int main()
{
  /* Обчислення значення функції, заданої логічною залежністю. Використання послідовних умовних операторів. */
  float x,  // значення аргумента
      y,    // значення функції
      a, b; // параметри функції
  int ind;  // індикатор друку значення функції
  system("chcp 1251 & cls");
  /* Виведення вигляду функції на екран */
  printf("sin(3x)       при x [0,5)\n");
  printf("2e^(ax-1)+1    при x=5\n");
  printf("(bx-a)^-1    при x (5,12]\n");
  /* Введення вхідних даних */
  printf("\nВведіть значення a ");
  scanf("%f", &a);
  printf("Введіть значення b ");
  scanf("%f", &b);
  printf("Введіть значення x ");
  scanf("%f", &x);
  ind = 0;
  /* Обчислення значення функції */
  /* Перший проміжок. ОДЗ не порушено */
  if ((x >= 0) && (x < 5) && (sin(3 * x) >= -1) && (sin(3 * x) <= 1))
  {
    y = sin(3 * x);
    ind = 1;
  }
  /* Перший проміжок. ОДЗ порушено */
  if ((x >= 0) && (x < 5) && ((sin(3 * x) < -1) || (sin(3 * x) > 1)))
    printf("ОДЗ сінуса порушено");
  /* Другий проміжок. Особливостей нема */
  if (x == 5)
  {
    // використовуємо функцію exp() для піднесення e в степень (ax-1)
    y = 2 * exp(a * x - 1) + 1;
    ind = 1;
  }
  /* Третій проміжок. Особливостей нема */
  if ((x > 5) && (x <= 12))
  {
    // використовуємо функцію pow() для піднесення числа в степень
    y = pow((b * x - a), -1);
    ind = 1;
  }
  /* Значення х задано поза проміжком */
  if ((x < 0) || (x > 12))
    printf("Функція не визначена");
  /* Друк результату обчислення */
  if (ind)
    printf("f(%4.2f)=%6.3f", x, y);
  /* Затримка вікна виведення */
  printf("\n\n");
  system("pause");
  return 0;
}