#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#define N 10

void vyvid(int a[N][N], int n);
void vyvid_z_vidilenam(int a[N][N], int n);
void vvid(int a[N][N], int n);
void random_numbers(int a[N][N], int n);
void first_task(int a[N][N], int n, int num, int *mostDifRow, int *mostDifCol);
void second_task(int a[N][N], int n, int *zeroNums);

int main()
{
  int n;   // заданий розмір квадратної матриці
  int v;   // варіант заповнення масиву
  int num; // задане числа

  int mostDifRow; // номер ряда елемента у секторі \7 ззначення якого найбільш відрізняється від заданого числа
  int mostDifCol; // номер колонки елемнта у секторі \7 значення якого найбільш відрізняється від заданого числа

  int zeroNums; // кількість елементів змінених на 0 у секторі 1/

  int a[N][N];

  system("chcp 1251 & cls");

  printf("Задайте порядок матриці n: "); // заданя порядку матриці
  scanf("%d", &n);

  printf("Якщо хочете заповнити масив a[%d][%d] вручну - натисніть 1 (в інших випадках масив заповниться рандомно): ", n, n); // вибір варіанту заповнення масиву
  scanf("%d", &v);

  if (v == 1)
    vvid(a, n); // заповнення масиву вручну
  else
    random_numbers(a, n); // заповнення масиву рандомно

  printf("Введіть задане значення для першої частини завдання: "); // введення заданого значення для першої частини завдання
  scanf("%d", &num);

  printf("\nВиведення початкового масиву:\n");
  vyvid_z_vidilenam(a, n); // виведення початкового масиву та виділення елементів сектора, який відповідає першій частині завдання

  first_task(a, n, num, &mostDifRow, &mostDifCol);                                                                                        // виконання першої частини завдання
  printf("\nНомер елементу у секторі \\7 значення якого найбільш відрізняється від заданого числа: a[%d][%d]\n", mostDifRow, mostDifCol); // вивід результату першої частини завдання

  second_task(a, n, &zeroNums);                                                 // виконання другої частини завдання
  printf("\nКількість елементів (змінених на 0) у секторі 1/: %d\n", zeroNums); // вивід результату другої частини завдання

  printf("\nМасив після обробки:\n"); // вивід масиву після обробки
  vyvid(a, n);

  printf("\n\n");
  system("pause");
  return 0;
}

/* Функція вводу елементів масиву вручну */
void vvid(int a[N][N], int n)
{
  int i, j; // індекси елементів масиву
  for (i = 0; i < n; i++)
    for (j = 0; j < n; j++)
    {
      printf("Введіть число a[%d][%d]: ", i, j);
      scanf("%d", &a[i][j]);
    }
}

/* Функція рандомного заповнення масиву */
void random_numbers(int a[N][N], int n)
{
  int i, j; // індекси елементів масиву

  srand(time(0)); // використовуємо функцію srand для того щоб получати кожен запуск програми нові послідовності чисел

  for (i = 0; i < n; i++)
    for (j = 0; j < n; j++)
      a[i][j] = (rand() % 100) + 1; // генерація рандомних чисел від 1 до 100
}

/* Функція для виведення початкового масиву та виділення елементів сектора, який відповідає першій частині завдання */
void vyvid_z_vidilenam(int a[N][N], int n)
{
  int i, j; // індекси елементів масиву

  for (i = 0; i < n; i++)
  {
    for (j = 0; j < n; j++)
    {
      if (j >= i) // елементи сектора \7
      {
        printf("*");
        printf("%d", a[i][j]); // виведення елементів масиву
        printf("*");
      }
      else // елементи поза сектором \7
      {
        printf("%*d ", 3, a[i][j]); // виведення елементів масиву
      }
      printf("   "); // пробіли для відокрмлення чисел при вивіденні
    }

    printf("\n");
  };
}

/* Функція для знаходження номеру(індексів) елементу у секторі \7, значення якого найбільш відрізняється від заданого числа */
void first_task(int a[N][N], int n, int num, int *mostDifRow, int *mostDifCol)
{
  int i, j; // індекси елементів масиву
  int maxDif = 0;

  for (i = 0; i < n; i++)
    for (j = i; j < n; j++)
    {
      int diff = abs(num - a[i][j]);
      if (diff > maxDif) // знаходимо максимальну різницю між заданим числом та елементами сектора
      {
        maxDif = diff;
        *mostDifRow = i;
        *mostDifCol = j;
      }
    }
}

/* Функція для рахування кількості елментів у секторі 1/ та їx заміни на 0 */
void second_task(int a[N][N], int n, int *zeroNums)
{
  int i, j; // індекси елементів масиву

  // перший сектор без діагоналей
  for (i = 0; i < (n - 1) / 2; i++)
    for (j = i + 1; j < n - i - 1; j++)
    {
      *zeroNums += 1;
      a[i][j] = 0;
    }

  // побічна діагональ
  for (i = 0; i < n; i++)
  {
    *zeroNums += 1;
    a[i][n - 1 - i] = 0;
  }
}

/* Виведення масиву */
void vyvid(int a[N][N], int n)
{
  int i, j; // індекси елементів масиву
  for (i = 0; i < n; i++)
  {
    for (j = 0; j < n; j++)
      printf("%-7d", a[i][j]);
    printf("\n");
  }
}